package week02.day10.연습문제;

public class Movielist {
	public static void main(String[] args) {
		Movie 오펜하이머 = new Movie("오펜하이머", "크리스토퍼놀란", "2023년8월15일", "킬리언 머피, 맷 데이먼", "스릴러", "180분", "8.4");
		Movie 조커 = new Movie("조커","토드필립스","2019년10월2일","호아킨 피닉스,로버트 드 니로","범죄","123분","8.9");
		Movie 닥터스트레인지 = new Movie("닥터스트레인지","샘 레이미","2022년5월4일","베네딕트 컴버비치,엘리자베스 올슨","SF","126분","6.2");
		Movie 스파이더맨 = new Movie("스파이더맨","존 왓츠","2022년10월5일","톰 홀랜드, 젠데이아","슈퍼히어로","148분","8.8");
		
//		오펜하이머.input("오펜하이머", "크리스토퍼놀란", "2023년8월15일", "킬리언 머피, 맷 데이먼", "스릴러", "180분", "8.4");
		오펜하이머.print();
		
//		조커.input("조커","토드필립스","2019년10월2일","호아킨 피닉스,로버트 드 니로","범죄","123분","8.9");
		조커.print();
		
		닥터스트레인지.print();
		스파이더맨.print();
		
		
		//객체배열사용		
		Movie[] arr = new Movie[4];		
		arr[0] = new Movie("오펜하이머", "크리스토퍼놀란", "2023년8월15일", "킬리언 머피, 맷 데이먼", "스릴러", "180분", "8.4");
		arr[1] = new Movie("조커","토드필립스","2019년10월2일","호아킨 피닉스,로버트 드 니로","범죄","123분","8.9");
		arr[2] = new Movie("닥터스트레인지","샘 레이미","2022년5월4일","베네딕트 컴버비치,엘리자베스 올슨","SF","126분","6.2"); 
		arr[3]=  new Movie("스파이더맨","존 왓츠","2022년10월5일","톰 홀랜드, 젠데이아","슈퍼히어로","148분","8.8");
		
		for( int i=0 ; i< arr.length ; i ++ ) {			
			arr[i].print();
		}
		
		
		
		
		
	}
}
